hpmicro/zephyr_sdk_glue/include/dt-bindings/clock/hpm6880-clocks.h
/*
 * Copyright (c) 2024-2025 HPMicro
 *SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6880_CLOCKS_H
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6880_CLOCKS_H

/*
 *
 *<---------------------- AUTO_GENERATE ---------------------->
 *    This file was auto-generated, do not edit anything.
 *    generated on 2025-08-04 16:09:58 
 */

#define CLK_SRC_OSC24M  0
#define CLK_SRC_PLL0_CLK0  1
#define CLK_SRC_PLL1_CLK0  2
#define CLK_SRC_PLL1_CLK1  3
#define CLK_SRC_PLL2_CLK0  4
#define CLK_SRC_PLL2_CLK1  5
#define CLK_SRC_PLL3_CLK0  6
#define CLK_SRC_PLL4_CLK0  7
#define CLK_SRC_OSC32K  8
#define CLK_ADC_SRC_ANA0  16
#define CLK_ADC_SRC_ANA1  16
#define CLK_ADC_SRC_AXI0  17
#define CLK_I2S_SRC_AUD0  32
#define CLK_I2S_SRC_AUD1  32
#define CLK_I2S_SRC_AUD2  32
#define CLK_I2S_SRC_AUD3  32
#define CLK_I2S_SRC_AUDN  32
#define CLK_I2S_SRC_AUDX  33
#define CLK_WDG_SRC_AXI0  48
#define CLK_WDG_SRC_OSC32K  49
#define CLK_PWDG_SRC_OSC24M  64
#define CLK_PWDG_SRC_OSC32K  65
#define CLK_SRC_INVALID  255

#define CLOCK_AXIF  4294901763
#define CLOCK_AXIS  16777220
#define CLOCK_AXIC  16842757
#define CLOCK_AXIV  16908294
#define CLOCK_AXIG  16973826
#define CLOCK_AXID  4294901767
#define CLOCK_AHB  4294837764
#define CLOCK_CPU0  0
#define CLOCK_MCHTMR0  17104897
#define CLOCK_GPU0  23068674
#define CLOCK_CAN0  17367048
#define CLOCK_CAN1  17432585
#define CLOCK_CAN2  17498122
#define CLOCK_CAN3  17563659
#define CLOCK_CAN4  17629196
#define CLOCK_CAN5  17694733
#define CLOCK_CAN6  17760270
#define CLOCK_CAN7  17825807
#define CLOCK_LIN0  18087952
#define CLOCK_LIN1  18153489
#define CLOCK_LIN2  18219026
#define CLOCK_LIN3  18284563
#define CLOCK_LIN4  18350100
#define CLOCK_LIN5  18415637
#define CLOCK_LIN6  18481174
#define CLOCK_LIN7  18546711
#define CLOCK_I2C0  18612248
#define CLOCK_I2C1  18677785
#define CLOCK_I2C2  18743322
#define CLOCK_I2C3  18808859
#define CLOCK_SPI0  18874396
#define CLOCK_SPI1  18939933
#define CLOCK_SPI2  19005470
#define CLOCK_SPI3  19071007
#define CLOCK_UART0  19136544
#define CLOCK_UART1  19202081
#define CLOCK_UART2  19267618
#define CLOCK_UART3  19333155
#define CLOCK_UART4  19398692
#define CLOCK_UART5  19464229
#define CLOCK_UART6  19529766
#define CLOCK_UART7  19595303
#define CLOCK_GPTMR0  19922984
#define CLOCK_GPTMR1  19988521
#define CLOCK_GPTMR2  20054058
#define CLOCK_GPTMR3  20119595
#define CLOCK_GPTMR4  20185132
#define CLOCK_GPTMR5  20250669
#define CLOCK_GPTMR6  20316206
#define CLOCK_GPTMR7  20381743
#define CLOCK_XPI0  21495856
#define CLOCK_LMM0  17041920
#define CLOCK_XRAM  17301553
#define CLOCK_DDR0  17237763
#define CLOCK_ETH0  21692472
#define CLOCK_PTP0  21692473
#define CLOCK_SDXC0  21823546
#define CLOCK_SDXC1  21889083
#define CLOCK_NTM0  21954620
#define CLOCK_REF0  22020157
#define CLOCK_REF1  22085694
#define CLOCK_CAMERA0  22151231
#define CLOCK_CAMERA1  22216768
#define CLOCK_LCD0  22413377
#define CLOCK_LCD1  22478914
#define CLOCK_CSI0  22675523
#define CLOCK_CSI1  22741060
#define CLOCK_DSI0  22808831
#define CLOCK_DSI1  22874367
#define CLOCK_GWC0  22546687
#define CLOCK_GWC1  22612223
#define CLOCK_LVB  22939903
#define CLOCK_LCB  23005439
#define CLOCK_FFA0  21563135
#define CLOCK_TSNS  21628415
#define CLOCK_PTPC  17893119
#define CLOCK_WATCHDOG0  19661568
#define CLOCK_WATCHDOG1  19727105
#define CLOCK_PUART  4294903295
#define CLOCK_PTMR  4294903295
#define CLOCK_PWDG  4294903295
#define CLOCK_SDP  20973311
#define CLOCK_XDMA  21432063
#define CLOCK_ROM  17172223
#define CLOCK_USB0  21759743
#define CLOCK_JPEG  22350079
#define CLOCK_PDMA  22284543
#define CLOCK_KMAN  21038847
#define CLOCK_GPIO  21104383
#define CLOCK_MBX0  19793663
#define CLOCK_MBX1  19859199
#define CLOCK_HDMA  21366527
#define CLOCK_RNG  20907775
#define CLOCK_PDM  20710143
#define CLOCK_DAO  20775679
#define CLOCK_SMIX  20841215
#define CLOCK_ANA0  4294901810
#define CLOCK_ANA1  4294901811
#define CLOCK_ADC0  21168384
#define CLOCK_ADC1  21233921
#define CLOCK_CRC0  17958655
#define CLOCK_AUD0  4294901812
#define CLOCK_AUD1  4294901813
#define CLOCK_AUD2  4294901814
#define CLOCK_AUD3  4294901815
#define CLOCK_I2S0  20447744
#define CLOCK_I2S1  20513281
#define CLOCK_I2S2  20578818
#define CLOCK_I2S3  20644355
#define CLK_OSC0CLK0  2099456
#define CLK_PLL0CLK0  2230529
#define CLK_PLL1CLK0  2361602
#define CLK_PLL1CLK1  2427139
#define CLK_PLL2CLK0  2558212
#define CLK_PLL2CLK1  2623749
#define CLK_PLL3CLK0  2754822
#define CLK_PLL4CLK0  2885895
#define CLOCK_CAM0  CLOCK_CAMERA0
#define CLOCK_CAM1  CLOCK_CAMERA1
#define CLOCK_FFA  CLOCK_FFA0


#endif  /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6880_CLOCKS_H */
